function fullMarkWithOptional() {
  const feedback = `

            মেইন-পার্ট
            
                1 . প্রজেক্টের একটা টাইটেল  দিতে হবে -  ঠিক আছে। 
                        
                2 . ন্যাভিগেশন থাকা লাগবে -  ঠিক আছে। 
                        
                3 . একপাশে একটি ছবি থাকবে  এবং একপাশে  টাইটেল ও কিছু মিনিংফুল লেখা থাকবে -  ঠিক আছে। 
                        
                4 . রিভিউ নিয়ে ফেইকডাটা বানাতে হবে এবং সেই ডাটা ব্যবহার করে কমপক্ষে  ৬ টি রিভিউ দেখাতে হবে রিভিউ রাউটে -  ঠিক আছে। 
                        
                5 . রিভিউ তে রিভিউ প্রদানকারীর নাম , রিভিউ এবং রেটিং থাকবে -  ঠিক আছে। 
                        
                6 . র‍্যান্ডম রাউটে ক্লিক করলে ৪০৪ এরর মেসেজ বা এই টাইপ ছবি দেখানো -  ঠিক আছে। 
                        
                7 . নেটলিফাইতে হোস্টিং এর পর রিলোড করলে  ৪০৪ ইস্যু সল্ভ -  ঠিক আছে। 
                        
                8 . ড্যাশবোর্ডে ক্লিক করলে কমপক্ষে দুটি চার্ট দেখাতে হবে । চার্ট এর জন্য আমাদের দেওয়া ডাটা  ব্যবহার করতে হবে -  ঠিক আছে। 
                        
            বোনাস-পার্ট
            
                9 . Readme.md ফাইলে প্রজেক্টের নাম ও লাইভ ওয়েবসাইটের লিংক থাকতে হবে -  ঠিক আছে। 
                        
                10 . প্রজেক্ট সম্পর্কে ৪ টি লাইন  বুলেট পয়েন্ট এ লিখতে হবে -  ঠিক আছে। 
                        
                11 . প্রজেক্টে ডেস্ট্রাকচারিং ব্যবহার করতে হবে এবং মিনিংফুল কম্পোনেন্ট/ ভ্যারিয়েবল নাম থাকতে হবে -  ঠিক আছে। 
                        
                12 . হোমপেইজে ৩ তি রিভিউ দেখাতে হবে -  ঠিক আছে। 
                        
                13 . মিনিমাম ৬ টা কমিট করতে হবে -  ঠিক আছে। 
                        
                14 .  ব্লগ রাউটে কমপক্ষে দুটি কোয়েশ্চন এর উত্তর লিখতে হবে -  ঠিক আছে। 
                        
            অপশনাল
            
                15 . রেস্পন্সিভ করা, এক্টিভ রাউট দেখানো, এক্সট্রা কোন রাউট তৈরী করা - দারুন হয়েছে।
        
        এক্সামিনারের ফিডব্যাকঃ আপনি  উত্তোরত্তর  উন্নতি  করছেন।  সেটা আপনার এসাইনমেন্ট  এ প্রকাশ পাচ্ছে। নিজেকে আরো ডেভলপ করুন,  আরো এগিয়ে  যান। একদিন অনেক ভাল ডেভেলপার  হবেন। দোয়া থাকল।
            
        
        বিদ্রঃ মার্ক্স রিলেটেড কোন কনফিউশন থাকলে গ্রুপে পোস্ট দেয়া যাবেনা। যদি আপনি কনফিডেন্ট থাকেন তাহলে আমাদের রিচেক অপশন আছে । রিচেক দিতে পারবেন। আপনার কারণ ভ্যালিড হলে মার্ক্স পেয়ে যাবেন , না হলে ২ মার্ক কাটা যাবে।

        অপশনাল পার্টের জন্য কোনো মার্ক্স কাটা হচ্ছেনা। 
        
        
    `;

  const textArea = document.querySelector(".ql-editor p");
  textArea.innerHTML = feedback;

  const markBox = document.getElementById("Mark");

  const totalMark = Number(document.querySelector(".font-weight-bold.pl-2")?.innerText) || 60;
  console.log(markBox);
  markBox.value = totalMark;
  markBox.focus();
}

function fullMarkWithOutOptional() {
  const feedback = `

            মেইন-পার্ট
            
                1 . প্রজেক্টের একটা টাইটেল  দিতে হবে -  ঠিক আছে। 
                        
                2 . ন্যাভিগেশন থাকা লাগবে -  ঠিক আছে। 
                        
                3 . একপাশে একটি ছবি থাকবে  এবং একপাশে  টাইটেল ও কিছু মিনিংফুল লেখা থাকবে -  ঠিক আছে। 
                        
                4 . রিভিউ নিয়ে ফেইকডাটা বানাতে হবে এবং সেই ডাটা ব্যবহার করে কমপক্ষে  ৬ টি রিভিউ দেখাতে হবে রিভিউ রাউটে -  ঠিক আছে। 
                        
                5 . রিভিউ তে রিভিউ প্রদানকারীর নাম , রিভিউ এবং রেটিং থাকবে -  ঠিক আছে। 
                        
                6 . র‍্যান্ডম রাউটে ক্লিক করলে ৪০৪ এরর মেসেজ বা এই টাইপ ছবি দেখানো -  ঠিক আছে। 
                        
                7 . নেটলিফাইতে হোস্টিং এর পর রিলোড করলে  ৪০৪ ইস্যু সল্ভ -  ঠিক আছে। 
                        
                8 . ড্যাশবোর্ডে ক্লিক করলে কমপক্ষে দুটি চার্ট দেখাতে হবে । চার্ট এর জন্য আমাদের দেওয়া ডাটা  ব্যবহার করতে হবে -  ঠিক আছে। 
                        
            বোনাস-পার্ট
            
                9 . Readme.md ফাইলে প্রজেক্টের নাম ও লাইভ ওয়েবসাইটের লিংক থাকতে হবে -  ঠিক আছে। 
                        
                10 . প্রজেক্ট সম্পর্কে ৪ টি লাইন  বুলেট পয়েন্ট এ লিখতে হবে -  ঠিক আছে। 
                        
                11 . প্রজেক্টে ডেস্ট্রাকচারিং ব্যবহার করতে হবে এবং মিনিংফুল কম্পোনেন্ট/ ভ্যারিয়েবল নাম থাকতে হবে -  ঠিক আছে। 
                        
                12 . হোমপেইজে ৩ তি রিভিউ দেখাতে হবে -  ঠিক আছে। 
                        
                13 . মিনিমাম ৬ টা কমিট করতে হবে -  ঠিক আছে। 
                        
                14 .  ব্লগ রাউটে কমপক্ষে দুটি কোয়েশ্চন এর উত্তর লিখতে হবে -  ঠিক আছে। 
                        
            অপশনাল
            
                15 . রেস্পন্সিভ করা, এক্টিভ রাউট দেখানো, এক্সট্রা কোন রাউট তৈরী করা - অপশনাল পার্টটুকু করার চেষ্টা করবেন। তাহলে আপনার প্রজেক্ট অন্যদের তুলনায় আরো ইউনিক হয়ে উঠবে।
        
        এক্সামিনারের ফিডব্যাকঃ আপনি  উত্তোরত্তর  উন্নতি  করছেন।  সেটা আপনার এসাইনমেন্ট  এ প্রকাশ পাচ্ছে। নিজেকে আরো ডেভলপ করুন,  আরো এগিয়ে  যান। একদিন অনেক ভাল ডেভেলপার  হবেন। দোয়া থাকল।
            
        
        বিদ্রঃ মার্ক্স রিলেটেড কোন কনফিউশন থাকলে গ্রুপে পোস্ট দেয়া যাবেনা। যদি আপনি কনফিডেন্ট থাকেন তাহলে আমাদের রিচেক অপশন আছে । রিচেক দিতে পারবেন। আপনার কারণ ভ্যালিড হলে মার্ক্স পেয়ে যাবেন , না হলে ২ মার্ক কাটা যাবে।

        অপশনাল পার্টের জন্য কোনো মার্ক্স কাটা হচ্ছেনা। 
        
        
    `;

  const textArea = document.querySelector(".ql-editor p");
  textArea.innerHTML = feedback;

  const markBox = document.getElementById("Mark");

  const totalMark = Number(document.querySelector(".font-weight-bold.pl-2")?.innerText) || 60;
  console.log(markBox);
  markBox.value = totalMark;
  markBox.focus();
}
